// Задачі
/* Ось для вас декілька простих задач на зазначені теми:

**1. .isInteger()**

Дано низку чисел: `3.14, 5, -3, 0.5, 8`. Визначте, які з них є цілими числами.



**2. .isSafeInteger()**

Дано числа: `9007199254740991` і `9007199254740993`. Визначте, яке з них є безпечним цілим числом у JavaScript.



**3. .toExponential()**

Перетворіть число `12345.6789` в експоненційну форму з трьома знаками після коми.



**4. .toPrecision()**

Дано число `0.00789`. Перетворіть його у строкове представлення з трьома значущими знаками.



Надіюсь, ці задачі вам сподобалися! */
