// **********************************************************//

// if - Логічний оператор
// === (Строго рівно поривнюючи з типом даних)
// == (Приблизно дорівнює )
// ? - Тринарниий оператор
// && - Логічне і
// !- not/ні
// for - цикл лічильник
// [] - масиви
// callback function -  Функція яка передається як параметер для іншої функції

// **********************************************************//
// const age = 27;

// if (age === 18) console.log("Підліток");

// if (age === 18) {
//     console.log("Підліток");
// } else if(age >= 19){
//     console.log("Дорослий");
// } else{
//     console.log('Дитина');
// }

// const get = age === 18 ? "Підліток" : "Дорослий";

// const get = age <= 12 ? 'Дитина' : (age >= 13 && age <= 18) ? 'Підліток' : 'Дорослий'
// console.log(get);

// ************************Task 1**********************************//
// Турнікет on/off
// const user = true;
// if(!user){
//     console.log('off');
// }else{
//     console.log('on');
// }
// ************************Task 1**********************************//

// const ok = 30;
// for (let i = 1; i <= ok; i++)
//     console.log(i);

// for (let i = 1; i <= ok; i++) {
//     console.log(i);
// }

// ************************Task 2**********************************//
// const hobies = [1,2,3,4,5,6,7,8,9,10]

// for(let i = 0; i < hobies.length; i++){
//     console.log(hobies[i]);
// }
// ************************Task 2**********************************//

// ************************Task 3**********************************//
// const hobies = [10,2,6,3,7,2,1,1,7,8,9,5,4,19,3,2]
// const result = []

// for(let i = 0; i < hobies.length; i++){
//     if(hobies[i] >= 6){
//         result.push(hobies[i])
//     }
// }
// console.log(result);
// const sum = result.reduce((ack, curV) => ack + curV, 0)
// console.log(sum);
// const sum = result.reduce((ack, curV) => ack + curV, 0)
// console.log(`Ваша відсортовани масив => [${result}], \ncума даних елементів масиву має такий вигляд ${sum}`);
// ************************Task 3**********************************//
