// Задача: З'єднати імена учасників
// У вас є два списки імен. Один список містить імена учасників, які прийдуть на вечірку з одного класу, а інший список містить імена учасників з іншого класу. Ваше завдання - створити єдиний список імен учасників, які прийдуть на вечірку, використовуючи методи "of", "from", "at" та "concat".

// Вхідні дані:
// Список імен учасників з першого класу: ["Олексій", "Ірина", "Максим"]
// Список імен учасників з другого класу: ["Анна", "Юрій", "Олена"]
// Вихідні дані:
// Єдиний список імен учасників: ["Олексій", "Ірина", "Максим", "Анна", "Юрій", "Олена"]
// Кроки для рішення:
// Створіть два масиви імен за допомогою методу of.
// Об'єднайте обидва масиви за допомогою методу concat.
// Перевірте, чи є в списку ім'я "Юрій" за допомогою методу at.
// Створіть новий список імен із єдиного списку за допомогою методу from.